#include <avr/io.h>
#include <avr/interrupt.h>
//-----------------------------------------------------
void port_ini(void)
{
	//Включим ножку светодиода на выход
	DDRB |= 0b00100000;
	//Включим ножки INT0 и INT1 (PD2 и PD3)  на вход
	DDRD &= ~(0b00001100);
	//Подтянем резистор на ножках INT0 и INT1 (PD2 и PD3) к питанию
	PORTD |= 0b00001100;
}
//-----------------------------------------------------
void int_ini(void)
{
	//включим прерывания INT0 и INT1 по нисходящему фронту
	EICRA|=(1<<ISC11)|(1<<ISC01);
	//разрешим внешние прерывания INT0 и INT1
	EIMSK|=(1<<INT1)|(1<<INT0);	
}
//-----------------------------------------------------
ISR(INT0_vect)
{
	PORTB |= 0b00100000;	
}
//-----------------------------------------------------
ISR(INT1_vect)
{
	PORTB &= ~(0b00100000);
}
//-----------------------------------------------------
int main(void)
{
    port_ini();
	int_ini();
	sei();
    while (1) 
    {
    }
}
//-----------------------------------------------------
